<?php return array (
  'SEO контроль' => 'SEO контроль',
  'Управление SEO' => 'Управление SEO',
  'Этот модуль может переназначить заголовки, ключевые слова и описания для определенной маски страниц.' => 'Этот модуль может переназначить заголовки, ключевые слова и описания для определенной маски страниц.',
  'Порядок' => 'Порядок',
  'Маска URL' => 'Маска URL',
  'Заголовок' => 'Заголовок',
  'Ключевые слова' => 'Ключевые слова',
  'Описание' => 'Описание',
  'Поиск по правилам' => 'Поиск по правилам',
  'Фраза по умолчанию' => 'Фраза по умолчанию',
  'Регулярное выражение (PCRE) которое сравнивается с текущим URI. Слеш экранируется автоматически, остальные символы(согласно правилам PCRE) необходимо экранировать обратным слешем вручную. Например:<br>\'.
                    \'<strong>/catalog/holodilnik/</strong> - маска страницы, URI которой содержит этот текст<br>\'.
                    \'<strong>^/$</strong> - маска главной страницы<br>\'.
                    \'<strong>^/catalog/klyuchi/</strong> - маска страницы категории товара "Ключи"<br>\'.
                    \'<strong>^/catalog/.*?/\\?p=2</strong> - маска второй страницы любой категории' => 'Регулярное выражение (PCRE) которое сравнивается с текущим URI. Слеш экранируется автоматически, остальные символы(согласно правилам PCRE) необходимо экранировать обратным слешем вручную. Например:<br>\'.
                    \'<strong>/catalog/holodilnik/</strong> - маска страницы, URI которой содержит этот текст<br>\'.
                    \'<strong>^/$</strong> - маска главной страницы<br>\'.
                    \'<strong>^/catalog/klyuchi/</strong> - маска страницы категории товара "Ключи"<br>\'.
                    \'<strong>^/catalog/.*?/\\?p=2</strong> - маска второй страницы любой категории',
  'Заголовок H1' => 'Заголовок H1',
  'В шаблоне на месте вывода H1 должна быть использована конструкция<br> &lt;h1&gt;{moduleinsert name=\\\'\\SeoControl\\Controller\\Block\\SeoH1\\\' default=\\\'Здесь значение H1 по умолчанию\\\'}&lt;/h1&gt;' => 'В шаблоне на месте вывода H1 должна быть использована конструкция<br> &lt;h1&gt;{moduleinsert name=\\\'\\SeoControl\\Controller\\Block\\SeoH1\\\' default=\\\'Здесь значение H1 по умолчанию\\\'}&lt;/h1&gt;',
  'SEO текст (допустим HTML)' => 'SEO текст (допустим HTML)',
  'Порядковый номер' => 'Порядковый номер',
);